#include <gtk/gtk.h>

#include "ol_osd_window.h"
#include "ol_test_util.h"

const char *LONG_LYRIC = "[00:24.85]我举杯 饮尽了风雪[00:31.01]是谁打翻前世柜 惹尘埃是非[00:37.26]缘字诀 几番轮回[00:41.39]你锁眉 哭红颜唤不回[00:47.45]纵然青史已经成灰 我爱不灭[00:54.82]繁华如三千东流水[00:58.97]我只取一瓢爱了解 只恋你化身的蝶[01:08.75]你发如雪 凄美了离别[01:13.44]我焚香感动了谁[01:18.07]邀明月 让回忆皎洁[01:22.20]爱在月光下完美[01:25.42]你发如雪 纷飞了眼泪[01:30.01]我等待苍老了谁[01:34.65]红尘醉 微醺的岁月[01:39.29]我用无悔 刻永世爱你的碑[01:43.39]Rap：[01:43.66]你发如雪 凄美了离别[01:45.97]我焚香感动了谁[01:47.62]邀明月 让回忆皎洁[01:49.79]爱在月光下完美[01:51.72]你发如雪 纷飞了眼泪[01:53.95]我等待苍老了谁[01:55.31]红尘醉 微醺的岁月[01:57.96][01:59.44]狼牙月 伊人憔悴[02:03.53]我举杯 饮尽了风雪[02:09.65]是谁打翻前世柜 惹尘埃是非[02:15.99]缘字诀 几番轮回[02:20.14]你锁眉 哭红颜唤不回[02:26.14]纵然青史已经成灰 我爱不灭[02:33.58]繁华如三千东流水[02:37.72]我只取一瓢爱了解 只恋你化身的蝶[02:47.31]你发如雪 凄美了离别[02:52.20]我焚香感动了谁[02:56.83]邀明月 让回忆皎洁[03:01.01]爱在月光下完美[03:04.14]你发如雪 纷飞了眼泪[03:08.76]我等待苍老了谁[03:14.12]红尘醉 微醺的岁月[03:18.74]我用无悔 刻永世爱你的碑[03:22.31]Rap：[03:23.08]你发如雪 凄美了离别[03:25.10]我焚香感动了谁[03:27.26]邀明月 让回忆皎洁[03:29.36]爱在月光下完美[03:31.32]你发如雪 纷飞了眼泪[03:33.55]我等待苍老了谁[03:35.85]红尘醉 微醺的岁月[03:37.70][03:38.47]你发如雪 凄美了离别[03:42.93]我焚香感动了谁[03:47.50]邀明月 让回忆皎洁[03:51.68]爱在月光下完美[03:54.78]你发如雪 纷飞了眼泪[03:59.44]我等待苍老了谁[04:03.59]红尘醉 微醺的岁月[04:08.74]我用无悔 刻永世爱你的碑[04:13.37]啦儿啦 啦儿啦 啦儿啦儿啦[04:17.21]啦儿啦 啦儿啦 啦儿啦儿啦[04:21.71]铜镜映无邪 扎马尾 你若撒野[04:26.96]今生我把酒奉陪[04:30.02]啦儿啦 啦儿啦 啦儿啦儿啦[04:33.70]啦儿啦 啦儿啦 啦儿啦儿啦[04:38.21]铜镜映无邪 扎马尾 你若撒野[04:43.51]今生我把酒奉陪[04:48.79]END";

void
basic_test ()
{
  GtkWidget *window = ol_osd_window_new ();
  gtk_widget_show (window);
  gtk_widget_destroy (window);
}

void
long_lyric_test ()
{
  GtkWidget *window = ol_osd_window_new ();
  gtk_widget_show (window);
  ol_osd_window_set_lyric (OL_OSD_WINDOW (window), 0, LONG_LYRIC);
  g_timeout_add (2000, (GSourceFunc)gtk_main_quit, NULL);
  gtk_main ();
  gtk_widget_destroy (window);
}

int
main (int argc, char **argv)
{
  gtk_init (&argc, &argv);
  basic_test ();
  long_lyric_test ();
}
